
## :x: Apply Failed

[CI link](https://github.com/mirror-kt/infra/actions/runs/5432192247)



<pre><code>Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

::debug::Terraform exited with code 1.
::debug::stdout: Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C%0Awill cancel the remote apply if it&#39;s still pending. If the apply started it%0Awill stop streaming the logs, but will not stop the apply running remotely.%0A%0APreparing the remote apply...%0A%0AThe remote workspace is configured to work with configuration at%0Aterraform relative to the target repository.%0A%0ATerraform will upload the contents of the following directory,%0Aexcluding files or directories as defined by a .terraformignore file%0Aat /home/runner/work/infra/infra/.terraformignore (if it is present),%0Ain order to capture the filesystem context the remote workspace expects:%0A    /home/runner/work/infra/infra%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/mirror_kt/infra/runs/run-MJEFJjQVbbvtsJ4P%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.5.2%0Aon linux_amd64%0AInitializing plugins and modules...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A%0ATerraform will perform the following actions:%0A%0A  # cloudflare_record.dmarc will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;dmarc&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;_dmarc&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;TXT&#34;%0A      &#43; value           = &#34;v=DMARC1; p=quarantine; rua=mailto:dmarc@mirror-kt.dev&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.dub_sh will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;dub_sh&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;s&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;CNAME&#34;%0A      &#43; value           = &#34;cname.dub.sh&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.github_pages_challenge will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;github_pages_challenge&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;_github-pages-challenge-mirror-kt&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;TXT&#34;%0A      &#43; value           = &#34;5ccd0ccb2e561700cb4bc02bfb98f1&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.keybase will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;keybase&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;_keybase&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;TXT&#34;%0A      &#43; value           = &#34;keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.mail will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;mail&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;mirror-kt.dev&#34;%0A      &#43; priority        = 0%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;MX&#34;%0A      &#43; value           = &#34;www2800.sakura.ne.jp&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.mc_chun_1 will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;mc_chun_1&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;mc.chun&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;NS&#34;%0A      &#43; value           = &#34;columbus.aternos.org&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.mc_chun_2 will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;mc_chun_2&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;mc.chun&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;NS&#34;%0A      &#43; value           = &#34;galileo.aternos.org&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.pleroma will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;pleroma&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;pleroma&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;A&#34;%0A      &#43; value           = &#34;34.134.233.145&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.root will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;root&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;mirror-kt.dev&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = true%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;CNAME&#34;%0A      &#43; value           = &#34;mirror-kt.pages.dev&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0A  # cloudflare_record.spf will be created%0A  &#43; resource &#34;cloudflare_record&#34; &#34;spf&#34; {%0A      &#43; allow_overwrite = false%0A      &#43; created_on      = (known after apply)%0A      &#43; hostname        = (known after apply)%0A      &#43; id              = (known after apply)%0A      &#43; metadata        = (known after apply)%0A      &#43; modified_on     = (known after apply)%0A      &#43; name            = &#34;mirror-kt.dev&#34;%0A      &#43; proxiable       = (known after apply)%0A      &#43; proxied         = false%0A      &#43; ttl             = 1%0A      &#43; type            = &#34;TXT&#34;%0A      &#43; value           = &#34;v=spf1 include:www2800.sakura.ne.jp ~all&#34;%0A      &#43; zone_id         = &#34;2f66eedd7ec5f96d1a218efade1f9a33&#34;%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0A
::debug::stderr: %0AError: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/8be9af7b-ad06-4d0a-97ee-a4697fb06f96/terraform-bin apply -no-color -input=false
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

The remote workspace is configured to work with configuration at
terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infra/infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infra/infra

To view this run in a browser, visit:
https://app.terraform.io/app/mirror_kt/infra/runs/run-MJEFJjQVbbvtsJ4P

Waiting for the plan to start...

Terraform v1.5.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.dmarc will be created
  + resource "cloudflare_record" "dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=quarantine; rua=mailto:dmarc@mirror-kt.dev"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.dub_sh will be created
  + resource "cloudflare_record" "dub_sh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "cname.dub.sh"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.github_pages_challenge will be created
  + resource "cloudflare_record" "github_pages_challenge" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-pages-challenge-mirror-kt"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "5ccd0ccb2e561700cb4bc02bfb98f1"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.keybase will be created
  + resource "cloudflare_record" "keybase" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_keybase"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mail will be created
  + resource "cloudflare_record" "mail" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + priority        = 0
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "MX"
      + value           = "www2800.sakura.ne.jp"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mc_chun_1 will be created
  + resource "cloudflare_record" "mc_chun_1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mc.chun"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "NS"
      + value           = "columbus.aternos.org"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.mc_chun_2 will be created
  + resource "cloudflare_record" "mc_chun_2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mc.chun"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "NS"
      + value           = "galileo.aternos.org"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.pleroma will be created
  + resource "cloudflare_record" "pleroma" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pleroma"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = "34.134.233.145"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "mirror-kt.pages.dev"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

  # cloudflare_record.spf will be created
  + resource "cloudflare_record" "spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mirror-kt.dev"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 include:www2800.sakura.ne.jp ~all"
      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"
    }

Plan: 10 to add, 0 to change, 0 to destroy.


Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

::debug::Terraform exited with code 1.
::debug::stdout: Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C%0Awill cancel the remote apply if it's still pending. If the apply started it%0Awill stop streaming the logs, but will not stop the apply running remotely.%0A%0APreparing the remote apply...%0A%0AThe remote workspace is configured to work with configuration at%0Aterraform relative to the target repository.%0A%0ATerraform will upload the contents of the following directory,%0Aexcluding files or directories as defined by a .terraformignore file%0Aat /home/runner/work/infra/infra/.terraformignore (if it is present),%0Ain order to capture the filesystem context the remote workspace expects:%0A    /home/runner/work/infra/infra%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/mirror_kt/infra/runs/run-MJEFJjQVbbvtsJ4P%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.5.2%0Aon linux_amd64%0AInitializing plugins and modules...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # cloudflare_record.dmarc will be created%0A  + resource "cloudflare_record" "dmarc" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "_dmarc"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "TXT"%0A      + value           = "v=DMARC1; p=quarantine; rua=mailto:dmarc@mirror-kt.dev"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.dub_sh will be created%0A  + resource "cloudflare_record" "dub_sh" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "s"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "CNAME"%0A      + value           = "cname.dub.sh"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.github_pages_challenge will be created%0A  + resource "cloudflare_record" "github_pages_challenge" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "_github-pages-challenge-mirror-kt"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "TXT"%0A      + value           = "5ccd0ccb2e561700cb4bc02bfb98f1"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.keybase will be created%0A  + resource "cloudflare_record" "keybase" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "_keybase"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "TXT"%0A      + value           = "keybase-site-verification=BUwOwC7eaSNWlnpB9toKGrkWPbK8Mnx5C4p1_PxLENE"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.mail will be created%0A  + resource "cloudflare_record" "mail" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mirror-kt.dev"%0A      + priority        = 0%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "MX"%0A      + value           = "www2800.sakura.ne.jp"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.mc_chun_1 will be created%0A  + resource "cloudflare_record" "mc_chun_1" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mc.chun"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "NS"%0A      + value           = "columbus.aternos.org"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.mc_chun_2 will be created%0A  + resource "cloudflare_record" "mc_chun_2" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mc.chun"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "NS"%0A      + value           = "galileo.aternos.org"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.pleroma will be created%0A  + resource "cloudflare_record" "pleroma" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "pleroma"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "A"%0A      + value           = "34.134.233.145"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.root will be created%0A  + resource "cloudflare_record" "root" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mirror-kt.dev"%0A      + proxiable       = (known after apply)%0A      + proxied         = true%0A      + ttl             = 1%0A      + type            = "CNAME"%0A      + value           = "mirror-kt.pages.dev"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0A  # cloudflare_record.spf will be created%0A  + resource "cloudflare_record" "spf" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "mirror-kt.dev"%0A      + proxiable       = (known after apply)%0A      + proxied         = false%0A      + ttl             = 1%0A      + type            = "TXT"%0A      + value           = "v=spf1 include:www2800.sakura.ne.jp ~all"%0A      + zone_id         = "2f66eedd7ec5f96d1a218efade1f9a33"%0A    }%0A%0APlan: 10 to add, 0 to change, 0 to destroy.%0A%0A
::debug::stderr: %0AError: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"03935ee64f22fbe28af98ffe7410402157338815","Vars":{},"WorkflowName":"Terraform"} -->